use crate::prelude::*;

pub const DEFAULT_XP: i64 = 0;
pub const DEFAULT_LEVEL: i64 = 1;

pub const MIN_XP: u32 = 5;
pub const MAX_XP: u32 = 15;
pub const XP_RANGE: std::ops::RangeInclusive<u32> = MIN_XP..=MAX_XP;

lazy_static! {
    pub static ref BOT_TOKEN: String = {
        #[allow(
            clippy::expect_used,
            reason = "If anything fails here, it should fail."
        )]
        std::env::var("BOT_TOKEN").expect("Expected a token in the dotenv file.")
    };
    pub static ref START_TIME: std::time::Instant = std::time::Instant::now();

    pub static ref XP_COOLDOWN_NUMBER_SECS: i64 = 60;
    pub static ref BOT_PREFIXES: Vec<String> = {
        let mut temp = vec![];
        temp.append(&mut upper_lowercase_permutations("hu"));
        temp.append(&mut upper_lowercase_permutations("ht"));

        temp
    };

    pub static ref VALID_MENTION_COUNT_PATTERNS: [&'static str; 2] = ["hutao", "hu tao"];


    /// # 2 groups
    ///
    /// *(matched via bitwise or `|`)*
    ///
    /// 1. emoji
    /// - `:UTF-8:`
    ///   - Exceptions for the `UTF-8` group:
    ///     - `:` & `<any-whitespace>` at both ends
    /// 2. embed_emoji
    /// - `[UTF-8](<any-pattern/nothing>)`
    ///   - Exceptions for the `UTF-8` group:
    ///     - `<any-whitespace>` at both ends
    ///     - `[` at the start
    ///     - `]` at the end
    ///
    /// ---
    ///
    /// <https://regex101.com/r/Yi782B/2>
    pub static ref EMOJIS_AND_EMBEDS_REGEX: Regex = {
        #[allow(
            clippy::unwrap_used,
            reason = "If anything fails here, it should fail."
        )]
        Regex::new(
            concat!(
                "(?<emoji>",
                    r":[^:\s]*:",
                ")|(?<embed_emoji>",
                    r"\[[^\[\]\s]*\]\([^()]*\)",
                ")",
            )
        ).unwrap()
    };

    /// The order of these entries is based on the in-game order.
    ///
    /// You can see it in the wiki too:
    /// - https://genshin-impact.fandom.com/wiki/Hu_Tao/Voice-Overs/Japanese
    pub static ref HU_TAO_VOICELINES_JP: &'static [&'static str; 74] = &[
        ////////////////////////////////////////////////////////////////////////////////////////////
        // Hello
        ////////////////////////////////////////////////////////////////////////////////////////////
        concat!(
            "堂主の私に何か用かな？あれ、知らなかった？私が往生堂七十七代目堂主、胡桃だよ！でもあ",
            "なた、ツヤのある髪に健康そうな体してる…そっか！仕事以外で私に用があるってことだね？",
        ),
        ////////////////////////////////////////////////////////////////////////////////////////////
        // Chats
        ////////////////////////////////////////////////////////////////////////////////////////////
        // - 1
        "私とお茶しない？えへへ～",
        // - 2
        "お客さんが一人、二人、三人…",
        // - 3
        "お日様が出たら日光浴、お月様が出たら月光浴～",
        ////////////////////////////////////////////////////////////////////////////////////////////
        // When
        ////////////////////////////////////////////////////////////////////////////////////////////
        // - it rains
        "うう…めんどくさいな～",
        // - thunder strikes
        "雷だよ！気をつけて！",
        // - it snows
        "わぁ！雪だ！",
        // - it's windy
        "ふぅ～気持ちいい～",
        // - the wind is blowing
        "帽子が飛んじゃうよ！",
        ////////////////////////////////////////////////////////////////////////////////////////////
        // Good
        ////////////////////////////////////////////////////////////////////////////////////////////
        // - morning
        "早寝早起きは体に良いね～",
        // - afternoon
        "よっ！お昼だね、ご飯食べた？",
        // - evening
        "へへへ、お月様が出てきたよ～外で見よう！",
        // - night
        "眠いの？じゃあ先に休んで、私はもう少し起きてるから。",
        ////////////////////////////////////////////////////////////////////////////////////////////
        // About Hu Tao
        ////////////////////////////////////////////////////////////////////////////////////////////
        // - name
        "胡桃の「ふ」はおふざけの「ふ」、胡桃の「た」はぐーたらの「た」！…え、面白くない？",
        // - favorite tricks
        "ほら見てて…火の玉！そして～ほい！火の蝶々！やった！飛んでる～",
        ////////////////////////////////////////////////////////////////////////////////////////////
        // About us
        ////////////////////////////////////////////////////////////////////////////////////////////
        // - curiousity
        "色んな所を旅してきたんでしょ。時間があったら私に色々聞かせて。",
        // - night (friendship lvl 6+)
        "昼間はどこに行っても大丈夫だけど、夜になったら気を付けて。と・く・に、私がいない時。",
        // - helper (friendship lvl 6+)
        "手伝ってほしい？私が必要？了解！あなたが困ってるなら、どこにいても全力で駆け付けるよ！",
        // - battle (friendship lvl 6+)
        concat!(
            "私にとって、戦いは目的じゃなくて手段。戦いという手段で大切なものを守るのが目的な",
            "の。この点に関しては、あなたと一緒だね。"
        ),
        // About the Vision (friendship lvl 4+)
        "「神の目」？「神の目」…うーん、その辺は縁次第ってところかな。",
        // Something to share
        concat!(
            "私たち往生堂には、二つの世界の人を満足させる責任がある。だから、依頼を受けたら必ず最",
            "後までやり遂げるの。",
        ),
        // Interesting things
        concat!(
            "陰気な場所に月光が差し込むことで生える花があるの。見たことない？じゃあ、今度見せてあ",
            "げるね。",
        ),
        ////////////////////////////////////////////////////////////////////////////////////////////
        // About characters (all things here are friendship 4+)
        ////////////////////////////////////////////////////////////////////////////////////////////
        // - Zhongli
        concat!(
            "鍾離さんはあんなに若いのに、性格は老人だね。何でも知ってるけど何に対しても興味がない",
            "…もしかして彼…ふふ、何でもない！",
        ),
        // - Qiqi
        "七七ちゃんを見かけた？どこにいるか教えて！あの子をどこかに隠してそれから……えへへへへ！",
        // - Baizhu
        "白朮？…はぁ、面倒くさい奴。",
        // - Ningguang
        concat!(
            "「天権」凝光、地位と富の頂点にいながら、美しく賢く、万物を見据えている。すっっっごく",
            "かっこいいよ！",
        ),
        // - Beidou
        concat!(
            "北斗姉は璃月の有名人よ。彼女は私を知らないけど、私は彼女を知ってる。あ～友達になりた",
            "いな。",
        ),
        // - Xingqiu
        concat!(
            "行秋坊ちゃまは本を書いてるらしいよ。どんな内容なんだろう？周りであった事を教えたら、",
            "面白い物語を書いてくれるかな。",
        ),
        // - Chongyun
        "純陽の体…まさかこんな体質の人がこの世にいるなんてね。",
        // - Xiao
        "仙人のこと？し、知らないよ？あわわ、お願いだから何も聞かないで！",
        // - Keqing
        concat!(
            "「玉衡」刻晴…大分話しづらい人ね。ほら、あの生真面目な感じ、からかったらどうなるのかな",
            "。まさか剣で叩かれないよね？…ね？",
        ),
        // - Xiangling
        concat!(
            "香菱ったら面白いんだよ！ちょっと触っただけでビックリして飛び跳ねるの！ああいう子大好",
            "きよ！でもやりすぎに注意しなきゃね、グゥオパァーに怒られちゃう…",
        ),
        // - Yun Jin
        concat!(
            "雲菫は正式な場ではとても優雅だけど、私生活ではすごく親しみやすいよ！この前彼女と賭け",
            "をしたの。負けた人が自分の得意とする歌い方で相手の書いた歌詞を歌うんだ。璃月劇版のヒ",
            "ルチャー夢、んもぉ～あなたも絶対聞いた方がいいって！",
        ),
        // - Shenhe
        concat!(
            "彼女は本当に面白い人だよ。他の誰とも違うの。ねぇ、私もこれから毎日、仙草を食べて山露",
            "を飲めば、彼女のように浮世離れした人になれるかな？えへへ…",
        ),
        ////////////////////////////////////////////////////////////////////////////////////////////
        // More about Hu Tao
        ////////////////////////////////////////////////////////////////////////////////////////////
        // - 1
        concat!(
            "ヒルチャールのお兄さんが病気になった♪…ヒルチャールのお姉さんが看病して♪…ヒルチャール",
            "のお兄さんが薬を飲んでも治らない♪…",
        ),
        // - 2 (friendship 3+)
        "路地裏に潜む漆黒の詩人とは、私のことよ！",
        // - 3 (friendship 4+)
        concat!(
            "「往生堂」の仕事は別に難しくも怖くもない、少し面倒なだけ。私たちを見かけたら怖がる人",
            "がいるから、何だか悲しいな。もう～そんなんじゃないのに！",
        ),
        // - 4 (friendship 5+)
        concat!(
            "私は「往生堂」七十七代目堂主、おじいちゃんが七十五代目よ。私が初めて引き受けた仕事は",
            "、おじいちゃんの葬儀だったの。うん？意外だった？知らないうちに何年もやってきた…時間",
            "が経つのって早いね。",
        ),
        // - 5 (friendship 6+)
        concat!(
            "陰陽は整然、運命は無常。死は予測できないけど、規則はある。覚えておいて、いつどんな時",
            "も、死を軽く扱っちゃだめ。死を理解し尊重してこそ、生きる価値を理解できるのよ。",
        ),
        // Hu Tao's hobbies
        "雲一つない空と、月光に満ちた夜空！こんな絶景、詩を作るにはぴったりね！",
        // Hu Tao's troubles
        "はぁ、何か面白いことないかな…何もすることがないのって、死より恐ろしいことだよ。",
        // Favorite food
        "ららら～♪水煮魚にエビ蒸し餃子～♪",
        // Least favorite food
        "清心とスライムの液体炒め…おぇ…香菱…私に対する復讐…？",
        ////////////////////////////////////////////////////////////////////////////////////////////
        // Recieving a gift
        ////////////////////////////////////////////////////////////////////////////////////////////
        // - 1
        "よしよし。堂主である私が、この料理に詩を一編書いてあげる——",
        // - 2
        "手伝わなくていいの？一皿作ったら、私がもう一皿おまけで作ってあげるよ！",
        // - 3
        "うぇ…これ何？",
        // Birthday
        concat!(
            "今宵は満天の星に華麗な月、さーぞかしいい日だろうね。うーん？うふふ…うん！知ってるよ、",
            "誕生日でしょ！もう、本当にいい日だね。",
        ),
        ////////////////////////////////////////////////////////////////////////////////////////////
        // Ascensions phases
        ////////////////////////////////////////////////////////////////////////////////////////////
        // - 1
        "おや？おやおや？",
        // - 2
        "うんうん、良い気持ち、ありがと！",
        // - 4
        "力に満ち溢れてる、こんなの初めて！何でもできる自信があるよ！",
        // - 6
        concat!(
            "力が限界に達した後に試されるのは心。あなたのおかげで、こんなにも素晴らしい境地にまで",
            "これた。ここは心と魂が交じり合い…生から死、天地から万物、全ての理が集う場所だね。",
        ),
        ////////////////////////////////////////////////////////////////////////////////////////////
        // Combat
        ////////////////////////////////////////////////////////////////////////////////////////////
        // - Skill
        "喝！",
        "起！",
        "散！",
        // - Burst
        "いってらっしゃい！", // ITTERASSHAI!!!!!
        "さよなら！",
        "燎原の蝶！",
        // - Sprint
        "ふぅ～っ！",
        "いこう！",
        "ヤッホー！",
        // - Wind glider
        "気持ちいい～",
        // - Treasure chest
        "当たり！",
        "どれどれ、何が入ってるかな～",
        "土に埋めたら宝箱がたくさん生えるかも！",
        // - Low hp :(
        "おやおや！",
        "ひぃっ！",
        "やばっ！",
        // - Ally low hp
        "落ち着いて！",
        "私が！",
        // - Fallen
        // ...
        // no.
        // - Joining party
        "あっ！やっと私の出番？",
        "見る目ある！",
        "全員あの世行き～",
        // - Idle
        "ヒルチャールのお兄さんが病気になった…ヒルチャールのお姉さんが看病して。",
        "ん？うわっ…ふん…びょんびょんびょんびょん…ぽん！さいなら～",
    ];

}
